{
  :ru => {
    :general_units => {
      :length => {
        :formats => {
          :long => {
            :mile_nautical => {:zero => "морских миль", :one => "морская миля", :two => "морские мили", :few => "морские мили", :many => "морских миль", :other => "морских миль"},
            :mile => {:zero => "миль", :one => "миля", :two => "мили", :few => "мили", :many => "миль", :other => "миль"},
            :yard => {:zero => "ярдов", :one => "ярд", :two => "ярда", :few => "ярда", :many => "ярдов", :other => "ярдов"},
            :foot => {:zero => "футов", :one => "фут", :two => "фута", :few => "футов", :many => "футов", :other => "футов"},
            :inch => {:zero => "дюймов", :one => "дюйм", :two => "дюйма", :few => "дюйма", :many => "дюймов", :other => "дюймов"},
            :kilometer => {:zero => "километров", :one => "километр", :two => "километра", :few => "километра", :many => "километров", :other => "километров"},
            :meter => {:zero => "метров", :one => "метр", :two => "метра", :few => "метра", :many => "метров", :other => "метров"},
            :centimeter => {:zero => "сантиметров", :one => "сантиметр", :two => "сантиметра", :few => "сантиметра", :many => "сантиметров", :other => "сантиметров"},
            :millimeter => {:zero => "миллиметров", :one => "миллиметр", :two => "миллиметра", :few => "миллиметра", :many => "миллиметров", :other => "миллиметров"}
          },
          :short => {
            :mile_nautical => {:zero => "м.миль", :one => "м.миля", :two => "м.мили", :few => "м.мили", :many => "м.миль", :other => "м.миль"},
            :mile => {:zero => "миль", :one => "миля", :two => "мили", :few => "мили", :many => "миль", :other => "миль"},
            :yard => {:zero => "ярдов", :one => "ярд", :two => "ярда", :few => "ярда", :many => "ярдов", :other => "ярдов"},
            :foot => {:zero => "футов", :one => "фут", :two => "фута", :few => "футов", :many => "футов", :other => "футов"},
            :inch => {:zero => "д", :one => "д", :two => "д", :few => "д", :many => "д", :other => "д"},
            :kilometer => {:zero => "км", :one => "км", :two => "км", :few => "км", :many => "км", :other => "км"},
            :meter => {:zero => "м", :one => "м", :two => "м", :few => "м", :many => "м", :other => "м"},
            :centimeter => {:zero => "см", :one => "см", :two => "см", :few => "см", :many => "см", :other => "см"},
            :millimeter => {:zero => "мм", :one => "мм", :two => "мм", :few => "мм", :many => "мм", :other => "мм"}
          }
        }
      }
    }
  }
}